import Banner, { BannerTypes } from "./banner";

const BannersData: BannerTypes[] = [
  {
    heading: "کشف مجموعه",
    title: "دوچرخه‌های کوهستانی",
    detail:
      "لورم ایپسوم متن ساخت نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و فعلی ته حال و آینده، شناخت قرار گیرد.",
    image: "/asset/moutain-bike.jpg",
    lists: [
      "لورم ایپسوم متن ساختگی",
      "با تولید سادگی نامفهوم",
      "ایپسوم متن ساختگی",
      "لورم ایپسوم متن ساخت صنعت چاپ",
      "نامفهوم از صنعت چاپ",
      "ایپسوم متن ساختگی",
    ],
    button: "کشف بیشتر",
    align: "start",
  },
  {
    heading: "کشف مجموعه",
    title: "دوچرخه‌های شهری",
    detail:
      "لورم ایپسوم متن ساخت نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون  شناخت قرار گیرد.",
    image: "/asset/city-bike.jpg",
    lists: [
      "لورم ایپسوم متن ساختگی",
      "با تولید سادگی نامفهوم",
      "ایپسوم متن ساختگی",
      "لورم ایپسوم متن ساخت صنعت چاپ",
      "نامفهوم از صنعت چاپ",
      "ایپسوم متن ساختگی",
    ],
    button: "کشف بیشتر",
    align: "start",
  },
  {
    heading: "کشف مجموعه",
    title: "دوچرخه‌های خاص",
    detail:
      "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، کتابهای زیادی درد استفاده قرار گیرد.",
    image: "/asset/speciality-bike.jpg",
    lists: [
      "لورم ایپسوم متن ساختگی",
      "با تولید سادگی نامفهوم",
      "ایپسوم متن ساختگی",
      "لورم ایپسوم متن ساخت صنعت چاپ",
      "نامفهوم از صنعت چاپ",
      "ایپسوم متن ساختگی",
    ],
    button: "کشف بیشتر",
    align: "start",
  },
];
const CollectionBanners = () => {
  return (
    <>
      {BannersData.map((banner, key) => (
        <Banner banner={banner} key={key} />
      ))}
    </>
  );
};

export default CollectionBanners;
